logrider/benchmarks/results/20260705221507-api-query/raw.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: benchmarks/k6/api-query.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * constant_request_rate: 50.00 iterations/s for 30s (maxVUs: 5-50, gracefulStop: 30s)


running (0m01.0s), 00/08 VUs, 47 complete and 0 interrupted iterations
constant_request_rate   [   3% ] 00/08 VUs  01.0s/30s  50.00 iters/s

running (0m02.0s), 00/08 VUs, 97 complete and 0 interrupted iterations
constant_request_rate   [   7% ] 00/08 VUs  02.0s/30s  50.00 iters/s

running (0m03.0s), 00/08 VUs, 147 complete and 0 interrupted iterations
constant_request_rate   [  10% ] 00/08 VUs  03.0s/30s  50.00 iters/s

running (0m04.0s), 00/08 VUs, 197 complete and 0 interrupted iterations
constant_request_rate   [  13% ] 00/08 VUs  04.0s/30s  50.00 iters/s

running (0m05.0s), 00/08 VUs, 247 complete and 0 interrupted iterations
constant_request_rate   [  17% ] 00/08 VUs  05.0s/30s  50.00 iters/s

running (0m06.0s), 00/08 VUs, 297 complete and 0 interrupted iterations
constant_request_rate   [  20% ] 00/08 VUs  06.0s/30s  50.00 iters/s

running (0m07.0s), 00/08 VUs, 347 complete and 0 interrupted iterations
constant_request_rate   [  23% ] 00/08 VUs  07.0s/30s  50.00 iters/s

running (0m08.0s), 00/08 VUs, 397 complete and 0 interrupted iterations
constant_request_rate   [  27% ] 00/08 VUs  08.0s/30s  50.00 iters/s

running (0m09.0s), 00/08 VUs, 447 complete and 0 interrupted iterations
constant_request_rate   [  30% ] 00/08 VUs  09.0s/30s  50.00 iters/s

running (0m10.0s), 00/08 VUs, 497 complete and 0 interrupted iterations
constant_request_rate   [  33% ] 00/08 VUs  10.0s/30s  50.00 iters/s

running (0m11.0s), 00/08 VUs, 547 complete and 0 interrupted iterations
constant_request_rate   [  37% ] 00/08 VUs  11.0s/30s  50.00 iters/s

running (0m12.0s), 00/08 VUs, 597 complete and 0 interrupted iterations
constant_request_rate   [  40% ] 00/08 VUs  12.0s/30s  50.00 iters/s

running (0m13.0s), 00/08 VUs, 647 complete and 0 interrupted iterations
constant_request_rate   [  43% ] 00/08 VUs  13.0s/30s  50.00 iters/s

running (0m14.0s), 00/08 VUs, 697 complete and 0 interrupted iterations
constant_request_rate   [  47% ] 00/08 VUs  14.0s/30s  50.00 iters/s

running (0m15.0s), 00/08 VUs, 747 complete and 0 interrupted iterations
constant_request_rate   [  50% ] 00/08 VUs  15.0s/30s  50.00 iters/s

running (0m16.0s), 00/08 VUs, 797 complete and 0 interrupted iterations
constant_request_rate   [  53% ] 00/08 VUs  16.0s/30s  50.00 iters/s

running (0m17.0s), 00/08 VUs, 847 complete and 0 interrupted iterations
constant_request_rate   [  57% ] 00/08 VUs  17.0s/30s  50.00 iters/s

running (0m18.0s), 00/08 VUs, 897 complete and 0 interrupted iterations
constant_request_rate   [  60% ] 00/08 VUs  18.0s/30s  50.00 iters/s

running (0m19.0s), 00/08 VUs, 947 complete and 0 interrupted iterations
constant_request_rate   [  63% ] 00/08 VUs  19.0s/30s  50.00 iters/s

running (0m20.0s), 00/08 VUs, 997 complete and 0 interrupted iterations
constant_request_rate   [  67% ] 00/08 VUs  20.0s/30s  50.00 iters/s

running (0m21.0s), 00/08 VUs, 1047 complete and 0 interrupted iterations
constant_request_rate   [  70% ] 00/08 VUs  21.0s/30s  50.00 iters/s

running (0m22.0s), 00/08 VUs, 1097 complete and 0 interrupted iterations
constant_request_rate   [  73% ] 00/08 VUs  22.0s/30s  50.00 iters/s

running (0m23.0s), 00/08 VUs, 1147 complete and 0 interrupted iterations
constant_request_rate   [  77% ] 00/08 VUs  23.0s/30s  50.00 iters/s

running (0m24.0s), 00/08 VUs, 1197 complete and 0 interrupted iterations
constant_request_rate   [  80% ] 00/08 VUs  24.0s/30s  50.00 iters/s

running (0m25.0s), 00/08 VUs, 1247 complete and 0 interrupted iterations
constant_request_rate   [  83% ] 00/08 VUs  25.0s/30s  50.00 iters/s

running (0m26.0s), 00/08 VUs, 1297 complete and 0 interrupted iterations
constant_request_rate   [  87% ] 00/08 VUs  26.0s/30s  50.00 iters/s

running (0m27.0s), 00/08 VUs, 1347 complete and 0 interrupted iterations
constant_request_rate   [  90% ] 00/08 VUs  27.0s/30s  50.00 iters/s

running (0m28.0s), 00/08 VUs, 1397 complete and 0 interrupted iterations
constant_request_rate   [  93% ] 00/08 VUs  28.0s/30s  50.00 iters/s

running (0m29.0s), 00/08 VUs, 1447 complete and 0 interrupted iterations
constant_request_rate   [  97% ] 00/08 VUs  29.0s/30s  50.00 iters/s

running (0m30.0s), 00/08 VUs, 1497 complete and 0 interrupted iterations
constant_request_rate   [ 100% ] 00/08 VUs  30.0s/30s  50.00 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 1497    49.899426/s
    checks_succeeded...: 0.00%   0 out of 1497
    checks_failed......: 100.00% 1497 out of 1497

    ✗ status was 200
      ↳  0% — ✓ 0 / ✗ 1497

    HTTP
    http_req_duration....: avg=1.41ms min=162.79µs med=891.79µs max=176.03ms p(90)=2.11ms p(95)=2.95ms
    http_req_failed......: 100.00% 2994 out of 2994
    http_reqs............: 2994    99.798852/s

    EXECUTION
    dropped_iterations...: 3       0.099999/s
    iteration_duration...: avg=3.21ms min=934.05µs med=1.9ms    max=203.75ms p(90)=4.62ms p(95)=5.9ms 
    iterations...........: 1497    49.899426/s
    vus..................: 0       min=0            max=0
    vus_max..............: 8       min=8            max=8

    NETWORK
    data_received........: 479 kB  16 kB/s
    data_sent............: 439 kB  15 kB/s



running (0m30.0s), 00/08 VUs, 1497 complete and 0 interrupted iterations
constant_request_rate ✓ [ 100% ] 00/08 VUs  30s  50.00 iters/s